dgarcoe/ham_radio_companion_sensecap_indicator/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (SenseCAP Indicator D1L = N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Custom partition table (factory + 2 ota + nvs + storage)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick
CONFIG_FREERTOS_HZ=1000

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="hamcompanion"

# LVGL: use PSRAM for buffers
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_COLOR_DEPTH_16=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
